Revit 2024 API
DisplacementElement.GetDisplacedElementIds Method
 The ids of the elements affected by this DisplacementElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ICollection<ElementId> GetDisplacedElementIds()
Visual Basic
Public Function GetDisplacedElementIds As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetDisplacedElementIds()
Return Value
 The element ids.
See Also
DisplacementElement Class
GetDisplacedElementIds Overload
Autodesk.Revit.DB Namespace